src/ut10_old/DataProcessors/ЛК_ФормированиеРозничныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ЛК_ФормированиеРозничныхЦен</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/ut10_old/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/ut10_old/Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>(Общ) Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>(Общ) Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупочная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Базовая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИндивидуальныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФормулыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеХарактеристики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие1</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УсловияФормулЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие2</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УсловияФормулЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ut10_old/DataProcessors/ЛК_ФормированиеРозничныхЦен/Ext/ObjectModule.bsl
Функция ПолучимиТоварыНоменклатурнойГруппы(НоменклатурнаяГруппа) Экспорт 
		
		Запрос = новый Запрос("ВЫБРАТЬ
		|	Номенклатура.Ссылка как Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа");
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа",НоменклатурнаяГруппа);
		
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		
		
	КонецФункции
	
Функция ПолучитьЗакупочнуюЦену(Номенклатура, ХарактеристикаH = Неопределено) Экспорт
		
		// НЧАН	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЦеныНоменклатурыСрезПоследних.Цена
		                      |ИЗ
		                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                      |			&Дата,
		                      |			Номенклатура = &Номенклатура
		                      |				И ТипЦен.Закупочная) КАК ЦеныНоменклатурыСрезПоследних");
		                      
		
		Если ХарактеристикаH <> Неопределено Тогда
			Запрос.Текст = Запрос.Текст + " 
			|ГДЕ
		    |	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаH); 
		КонецЕсли;
			
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());
		
		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;
		
		//	КЧАН	
		
	КонецФункции
	
Функция ПолучитьБазовуюЦену(Номенклатура) Экспорт
		
		Запрос = новый Запрос("ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И ТипЦен.Базовая) КАК ЦеныНоменклатурыСрезПоследних");
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());

		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;
		
		
		
КонецФункции
	
Функция ПолучитьРозничнуюЦену(Номенклатура,ТипЦен) Экспорт
		
		Запрос = новый Запрос("ВЫБРАТЬ
		                      |	ЦеныНоменклатурыСрезПоследних.Цена
		                      |ИЗ
		                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                      |			&Дата,
		                      |			Номенклатура = &Номенклатура
		                      |				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних");
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
         Запрос.УстановитьПараметр("Дата",ТекущаяДата());

		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;
		
		
		
КонецФункции

Функция ПолучитьОстатки(Номенклатура,Склад = неопределено) Экспорт
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ТоварыНаСкладахОстатки.Номенклатура,
	                      |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                      |			&Дата,
	                      |			Номенклатура = &Номенклатура
	                      |				{И Склад = &Склад}) КАК ТоварыНаСкладахОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыНаСкладахОстатки.Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Если Склад <> Неопределено тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"{И Склад = &Склад}","И Склад = &Склад");
		Запрос.УстановитьПараметр("Склад",Склад);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"{И Склад = &Склад}","");
	КонецЕсли;
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() тогда
		Возврат Результат.КоличествоОстаток;
	Иначе
		Возврат 0
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьРасчетноБазовуюЦену (Номенклатура,Склад = неопределено) Экспорт
	
	РасчетноБазоваяЦена = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000074");

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыСрезПоследних.Цена
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                      |			&Дата,
	                      |			Номенклатура = &Номенклатура
	                      |				И ТипЦен = &РасчетноБазоваяЦена) КАК ЦеныНоменклатурыСрезПоследних");
						  
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());
		Запрос.УстановитьПараметр("РасчетноБазоваяЦена",РасчетноБазоваяЦена);


		Результат = Запрос.Выполнить().Выбрать(); 
		
		Если Результат.Следующий() тогда
			
			Возврат Результат.Цена;
			
		Иначе
			
			Возврат 0;
			
		КонецЕсли;

КонецФункции
